two_dimensional_flow/mapping/data/0_0/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		2.0;
	format		ascii;
	class		dictionary;
	location	"system";
	object		snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh			true;
snap					true;
addLayers				false;

geometry
{
	inner.stl
	{
 		type		triSurfaceMesh;
		name		inner;
	}
	
	outer_cylinder.stl
	{
		type		triSurfaceMesh;
		name		outer_cylinder;
	}
};

castellatedMeshControls
{
	maxLocalCells		100000000;
	maxGlobalCells		200000000;
	minRefinementCells	0;
	maxLoadUnbalance	0.10;
	nCellsBetweenLevels	4;
	resolveFeatureAngle	180;
	features
	(
		{
			file "inner.eMesh";
			level 2;
		}
		
		{
		    file "outer_cylinder.eMesh";
		    level 2;
		}
	);

	refinementSurfaces
	{
		inner
		{
			level (2 2);
		}
		
		outer_cylinder
		{
		    level (2 2);
		}
	}

	refinementRegions
	{
	}
	locationInMesh			(1.2501 1.2501 0.2501);
	allowFreeStandingZoneFaces	true;
}

snapControls
{
	nSmoothPatch		0;
	tolerance		1.0;
	nSolveIter		50;
	nRelaxIter		5;
	nFeatureSnapIter	10;
	implicitFeatureSnap	false;
	explicitFeatureSnap	true;
	multiRegionFeatureSnap	false;
}

addLayersControls
{
	relativeSizes			false;
	layers
	{
		bodyA
		{
			nSurfaceLayers	20;
		}
	}

	expansionRatio			1.2;
	firstLayerThickness		1e-4;
	minThickness			1e-4;
	nGrow				0;
	featureAngle			130;
	nRelaxIter			5;
	nSmoothSurfaceNormals		20;
	nSmoothNormals			30;
	nSmoothThickness		30;
	maxFaceThicknessRatio		20;
	maxThicknessToMedialRatio	20;
	minMedialAxisAngle		130;
	nBufferCellsNoExtrude		0;
	nLayerIter			50;
}

meshQualityControls
{
	maxNonOrtho			70;
	maxBoundarySkewness		20;
	maxInternalSkewness		4;
	maxConcave			80;
	minFlatness			0.5;
	minVol				1e-13;
	minTetQuality			-1;
	minArea				-1;
	minTwist			-1;
	minDeterminant			0.001;
	minFaceWeight			0.02;
	minVolRatio			0.01;
	minTriangleTwist		-1;
	nSmoothScale			4;
	errorReduction			0.75;
}

debug 0;
mergeTolerance 1E-6;
