two_dimensional_flow/mapping/data/0_0/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		2.0;
	format		ascii;
	class		dictionary;
	location	"system";
	object		surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

inner.stl
{
	extractionMethod		extractFromSurface;

	extractFromSurfaceCoeffs
	{
		includedAngle		180;
	}

	writeObj			yes;
}

outer_cylinder.stl
{
	extractionMethod		extractFromSurface;

	extractFromSurfaceCoeffs
	{
		includedAngle		180;
	}

	writeObj			yes;
}

